run/testInjection/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField  uniform 0.1;

boundaryField
{
    atmosphere
    {
        type turbulentIntensityKineticEnergyInlet;
        intensity 0.55;
        value $internalField;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    inlet
    {
        type turbulentIntensityKineticEnergyInlet;
        intensity 0.15;
        value $internalField;
    }
    
    side
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
