run/testInjection/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          multicomponentFluid;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5e-4;

deltaT          5e-6;

writeControl    adjustableRunTime;

writeInterval   5e-6;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression false;

timeFormat      general;

timePrecision   6;

adjustTimeStep  false;

maxCo           0.2;

runTimeModifiable true;

// ************************************************************************* //
